In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Passageiros.csv")

In [3]:
df.head()

   Categoria     Gênero  Idade      Valor      Embarque        Date
0          1  Masculino   22.0  R$ 300,00        Sábado  05-01-2019
1          2   Feminino   32.0  R$ 200,00  Quarta-Feira  02-01-2019
2          3  Masculino   23.0  R$ 160,00  Quarta-Feira  02-01-2019
3          1   Feminino   25.0  R$ 300,00       Domingo  06-01-2019
4          2  Masculino   23.0  R$ 200,00  Quarta-Feira  16-01-2019

In [4]:
# Idade agora é INT64
df.Idade =  df.Idade.astype(int)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Categoria  9 non-null      int64
 1   Gênero     9 non-null      object
 2   Idade      9 non-null      int64
 3   Valor      9 non-null      object
 4   Embarque   9 non-null      object
 5   Date       9 non-null      object
dtypes: int64(2), object(4)
memory usage: 560.0+ bytes

In [8]:
# Não há mais casas decimais:
df.Idade

0    22
1    32
2    23
3    25
4    23
5    48
6    53
7    34
8    67
Name: Idade, dtype: int64

In [11]:
# A coluna 'Valor' é alfanumerica (letras + caracteres)
# Éla é vista como objeto.

# NÃO É POSSIVEL FAZER O MESMO TIPO DE CONVERSÃO ANTERIOR AQUI
df.Valor.dtype

dtype('O')

In [12]:
# TEMOS QUE RETIRAR AS LETRAS/CARACTERES PRIMEIRO:
df['Valor'] = df['Valor'].apply(lambda x:x.replace("R$", ""))

In [13]:
# RETIRAMOS O R$ :
df.Valor

0     300,00
1     200,00
2     160,00
3     300,00
4     200,00
5     300,00
6      80,00
7     400,00
8     200,00
Name: Valor, dtype: object

In [15]:
# DEVEMOS TAMBÉM SUBSTITUIR A VIRGULA por pontos:
df['Valor'] = df['Valor'].apply(lambda x:x.replace(",", "."))

In [16]:
# AGORA PODEMOS CONVERTER:

df.Valor =  df.Valor.astype(float)

In [17]:
df.Valor

0    300.0
1    200.0
2    160.0
3    300.0
4    200.0
5    300.0
6     80.0
7    400.0
8    200.0
Name: Valor, dtype: float64